[
  {
    "Award Number": 670,
    "Award Cycle": "2024W",
    "Award Name": "Northern Telecom Graduate Fellowship",
    "Award Type": "FELL",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "AU-G+PS - Faculty of Graduate and Postdoctoral Studies",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Affiliated Fellowships (GSSA)",
    "Campus": "V",
    "Eligible Learner Level": "Graduate",
    "Award Description": "Fellowships totalling $15,100 have been endowed by Northern Telecom Ltd. with the support of the Province of B.C. They are available to outstanding graduates in any field, and are made on the recommendation of the Faculty of Graduate and Postdoctoral Studies."
  },
  {
    "Award Number": 5251,
    "Award Cycle": "2024W",
    "Award Name": "Andrew Arida Memorial Beyond Tomorrow Scholars Award",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "FO-AWFA - Student Financial Assistance and Awards",
    "Award Cycle Status": "ACCS",
    "Primary Award Program": "Beyond Tomorrow Scholars Awards (ENRL)",
    "Campus": "A",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "Awards totalling $5,000 have been made available through an endowment established by friends, family and colleagues in memory of Andrew Arida (1970-2021), along with matching funds from the University of British Columbia, for outstanding domestic students who identify as Black and are entering an undergraduate program directly from secondary school or transferring from another post-secondary institution. Recipients are academically qualified and would not be able to attend UBC without financial assistance. In addition to academic merit, consideration is given to qualities such as leadership skills, community service, and recognized extra-curricular achievement. Subject to continued academic standing, the awards will be renewed for a further three years of study or until the first undergraduate degree is obtained (whichever comes first). Ideally, recipient selection will alternate between the Vancouver and Okanagan campuses. Andrew (B.A., M.A. 2014) joined UBC in 1996, working in a variety of positions in recruitment and admissions before assuming the position of Deputy Registrar in 2018. He was devoted to attracting well-rounded students to campus, and was proud to see UBC become increasingly diverse and accessible under his leadership. Andrew received UBCs Presidents Service Award for Excellence in 2018 in recognition of his contributions and service. A musician, traveler, and soccer fan, Andrew regularly gave back to the community through volunteer work. The awards are adjudicated by Enrolment Services."
  },
  {
    "Award Number": 5101,
    "Award Cycle": "2024W",
    "Award Name": "Cathay Pacific Education Abroad Scholarship",
    "Award Type": "SCHL",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "FO-GLBL - Go Global: Internal Learning Program",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Go Global Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Both",
    "Award Description": "A $7850 scholarship has been endowed by Cathay Pacific Airways Ltd. and the Province of British Columbia for students participating in the Education Abroad Programs between UBC and universities in Asia. The award alternates between a student coming to UBC, with preference given to a student from Hong Kong, and a UBC student exchanging with a visiting student. The award for the incoming student is made on the recommendation of an Alumni Committee in Hong Kong and  the award for the outgoing student is made on the nomination of the Education Abroad Advisory Committee. Students are designated Cathay Pacific Education Abroad Scholars."
  },
  {
    "Award Number": 5248,
    "Award Cycle": "2024W",
    "Award Name": "International Impact Award Vancouver(Tuition)",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "FO-ISTI - International Student Initiative",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "International Student Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "Awards ranging in value up to the full cost of the student's program and living costs are offered upon recommendation by the International Student Initiative to outstanding international students who demonstrate financial need. The value of each award will depend on the applicant's financial circumstances. The awards are made to students entering the University of British Columbia Vancouver campus directly from secondary school or from a post-secondary institution, to an undersubscribed undergraduate program of study. In addition to academic merit, priority is given to those exhibiting qualities such as leadership skills, involvement in student affairs or contribution to community service, first generation learners and those from diverse lived and socioeconomic backgrounds. Candidates must demonstrate prior commitment to, and interest in engaging further, via artistic expression or community engagement, social justice and equity, human wellness or conservation, sustainability and climate change. Consideration is restricted to students nominated by the educational institution they are attending. The awards will be renewed for up to three additional years of undergraduate study or to degree completion, whichever is less, provided the recipient maintains award standing in their program of study and maintains their status on a student authorization to study in Canada. Award winners will have their situations reviewed annually regarding both academic progress and financial need."
  },
  {
    "Award Number": 8483,
    "Award Cycle": "2024W",
    "Award Name": "Karen McKellin International Leader of Tomorrow Award (Start Up)",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "FO-ISTI - International Student Initiative",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "International Student Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "Awards ranging in value from $14,000 to $34,000 each are offered to outstanding international students who would otherwise be financially unable to pursue post secondary education. The value of each award will depend on the applicant's financial circumstances. The awards are made to students entering the University directly from secondary school or transferring from another post secondary institution to an undergraduate program of study. In addition to academic merit, consideration is given to qualities such as leadership skills, involvement in student affairs or contribution to community service, to recognized achievement in fields of endeavor such as performing arts, athletics, debating or creative writing, and to achievement on external math or science competitions or examinations such as the International Chemistry and Physics Olympiads. Consideration is restricted to students nominated by the educational institution they are attending. The range for this award will be reviewed and adjusted annually to reflect any changes in international student tuition and cost of living. The awards will be renewed for up to three additional years of undergraduate study or to degree completion, whichever is less, provided the recipient stands in the top quartile of his or her program of study and maintains his/her status on a student authorization to study in Canada. Award winners will have their situations reviewed annually regarding both academic progress and financial need to determine the amount of the award in subsequent years for which they are eligible."
  },
  {
    "Award Number": 6544,
    "Award Cycle": "2024W",
    "Award Name": "Syd Vernon Graduate Student Award",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Auto-Consideration",
    "Administering Unit": "AU-G+PS - Faculty of Graduate and Postdoctoral Studies",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Spring Graduate Awards (GSSA)",
    "Campus": "V",
    "Eligible Learner Level": "Graduate",
    "Award Description": "Awards totalling $45,000 are offered through an endowment established by the Syd Vernon Foundation and administered by the Vancouver Foundation. The Syd Vernon Fund for the Disabled, established in 1989, honours the memory of Sydney Edward Vernon, founder of Auto Marine Electric Ltd and a pioneer of the automotive aftermarket parts industry in Canada. This Fund supports charitable organizations for the betterment of persons with mental, physical or sensory disabilities. The Fund also supports the advancement of education for those persons committed to working with people with disabilities and their families. The awards are available to UBC graduate students who are Canadian citizens, with demonstrated commitment to the disability areas described above, through courses selected, personal experience, past or current employment and/or volunteering that involves working directly with people with developmental disabilities. Minimum individual award is $2,000 up to a maximum of $3,500. Awards are made on the recommendation of the Faculty of Graduate and Postdoctoral Studies."
  },
  {
    "Award Number": 2356,
    "Award Cycle": "2024W",
    "Award Name": "Paul Robert Steiner Memorial Scholarship in Wood Science",
    "Award Type": "SCHL",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "AU-FRST - Faculty of Forestry",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Undergraduate Recommended Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "A $3,000 scholarship has been endowed by friends and faculty members in the Department of Wood Science in memory of Paul Robert Steiner. The award is offered to the top undergraduate student entering third or fourth year in the B.Sc. (Wood Products Processing) program and is made on the recommendation of the Faculty of Forestry."
  },
  {
    "Award Number": 3955,
    "Award Cycle": "2024W",
    "Award Name": "Thunderbird Women's Basketball Award",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "FO-ATHL - Athletics and Recreation (UBCV)",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Undergraduate Recommended Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "One or more awards, which may range from a minimum value of $500 each to the maximum allowable under athletic association regulations, are offered to outstanding members of the Thunderbird Women's Basketball Team in any year of study. Awards are made on the nomination of the President's Athletic Awards Committee."
  },
  {
    "Award Number": 4435,
    "Award Cycle": "2024W",
    "Award Name": "George E. LOVESETH Award in Geological Sciences",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "AU-EOAS - Department of Earth, Ocean and Atmospheric Sciences",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Undergraduate Recommended Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "Awards totaling $9350 have been endowed by George E. Loveseth (B.A.Sc. 1958) to support undergraduate students in Geological Sciences, with a preference for those in the final year of Geological Engineering or Honours Geology. The awards are made on the recommendation of the Department of Earth, and Ocean and Atmospheric Sciences."
  },
  {
    "Award Number": 2776,
    "Award Cycle": "2024W",
    "Award Name": "M F Jefferson Smith Memorial Award",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "AU-LAW - Peter A. Allard School of Law",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Undergraduate Recommended Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "A $400 award has been endowed in memory of Jeff Smith, B.Comm. LL.B. 1978, by his family and friends. Jeff practised law in Vancouver with a particular emphasis on Criminal Law and Civil Litigation. Jeff was an active person and led a full life. He had the capacity to excel in every endeavour he undertook. He gave of himself fully in all he did and his generosity and warmth characterized his friendships. It is awarded to a student entering second year law with sound academic standing and a positive approach to life."
  },
  {
    "Award Number": 3960,
    "Award Cycle": "2024W",
    "Award Name": "Colin Cool Gerlitz Track and Cross Country Award",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "FO-ATHL - Athletics and Recreation (UBCV)",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Undergraduate Recommended Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "One or more awards, which may range in value from a minimum of $550 to the maximum allowable under athletic association regulations, are offered to outstanding members of the Track and Cross Country team in any year of study.  The awards are made on the recommendation of the President's Athletic Awards Committee."
  },
  {
    "Award Number": 608,
    "Award Cycle": "2024W",
    "Award Name": "Burke-Penn Memorial Award",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "FO-VCVR - UBC - Vancouver",
    "Award Cycle Status": "ACOS",
    "Primary Award Program": "Undergraduate Recommended Awards (ENRL)",
    "Campus": "V",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "Up to two awards totalling $2500 have been endowed by the Alumni of Beta Theta Pi Fraternity, to recognize the contribution of Gordon Burke and Richard Penn to the community, the university, and the fraternity. The awards are made to undergraduate members of Beta Theta Pi, who are proceeding into the final undergraduate year in their faculty and who demonstrates to the Selection Committee appropriate standards of scholarship, student activity and service within the fraternity. Members of the fraternity who wish to be considered for the award should contact the active Chapter President in the fall."
  },
  {
    "Award Number": 21517,
    "Award Cycle": "2024W",
    "Award Name": "Grant Thornton LLP Award in Accounting",
    "Award Type": "AWRD",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "AU-MGMT - Faculty of Management",
    "Award Cycle Status": "DACS",
    "Primary Award Program": "Undergraduate Recommended Awards (OKES)",
    "Campus": "O",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "A $2,000 award has been made available annually through a gift from Grant Thornton LLP for a third-year student in the Bachelor of Management program in the Faculty of Management at the University of British Columbia, Okanagan campus. Preference will be given to students pursuing a career in chartered professional accounting who have excelled in accounting courses and have demonstrated a strong involvement in professional and extracurricular activities. Equal consideration is to be given to academic and non-academic criteria. The award is made on the recommendation of the Faculty of Management."
  },
  {
    "Award Number": 21117,
    "Award Cycle": "2024W",
    "Award Name": "Norma and Jack Aitken Prize in Visual Arts",
    "Award Type": "PRIZ",
    "Application Type (Award Profile)": "Award Application",
    "Administering Unit": "AU-CCS - Faculty of Creative and Critical Studies",
    "Award Cycle Status": "DACS",
    "Primary Award Program": "Undergraduate Recommended Awards (OKES)",
    "Campus": "O",
    "Eligible Learner Level": "Undergraduate",
    "Award Description": "A $4,150 prize has been endowed by the family and friends of Norma and Jack Aitken to honour their memory and to recognize Norma Aitken's lifelong contributions to the visual arts.  The prize is awarded to a student in the Visual Arts Program in the Faculty of Creative and Critical Studies at The University of British Columbia Okanagan who has demonstrated outstanding achievement in the Program.  The award is made on the recommendation of the Faculty."
  }
]